Revit 2024 API
MEPCalculationServerInfo.GetMEPCalculationServerInfo Method
 Gets a MEPCalculationServerInfo by family instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static MEPCalculationServerInfo GetMEPCalculationServerInfo(
	FamilyInstance famInst
)
Visual Basic
Public Shared Function GetMEPCalculationServerInfo ( _
	famInst As FamilyInstance _
) As MEPCalculationServerInfo
Visual C++
public:
static MEPCalculationServerInfo^ GetMEPCalculationServerInfo(
	FamilyInstance^ famInst
)
Parameters
famInst
Type: Autodesk.Revit.DB.FamilyInstance
 The family instance.
Return Value
 The MEPCalculationServerInfo.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MEPCalculationServerInfo Class
Autodesk.Revit.DB Namespace